Revit 2026 API

# OutlineAddPoint Method

---

Adds a point to the bounding box, expanding it if the point is outside the existing boundary.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddPoint(
	XYZ point
)
```
```vb
Public Sub AddPoint (
	point As XYZ
)
```
```cpp
public:
void AddPoint(
	XYZ^ point
)
```
```fsharp
member AddPoint :
        point : XYZ -> unit
```

#### Parameters

point XYZ
     The point to add.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Outline Class

Autodesk.Revit.DB Namespace